<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"13bfe6a5c51329119db7931c1395aa172bcf4b104b6b5535f097cf86a583b0d4","plan_job_ref":"Job Test terraform-refresh #29 at https://github.com/dflook/terraform-github-actions/actions/runs/15311002257","plan_out_hash":"57069a58fce109e37e2bf11657bbcc72a5da55fb08b75d7835a7d3b2943a5db1","plan_hash":"e14284f43b2ed44f9dc3ed13b8f3ce33e3b0c2e89f0b2b1b81a01f085733ee46","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #29](https://github.com/dflook/terraform-github-actions/actions/runs/15311002257)